Tekla.Structures.Model.ViewExtensions
The Tekla.Structures.Model.ViewExtensions class provides a set of static methods for handling the Tekla.Structures.Model.UI.View.

Tekla.Structures.Model.ViewExtensions.FitWorkArea(Tekla.Structures.Model.UI.View,System.Boolean)
Fits the work area of the view.
view: The view.
onSelectedObjects: Whether the work area is fit based on the selected objects.
Returns: True on success; otherwise, false.